from builtins import print


# +--------------------------------------------------------------------------
# |::::TIPS::::| 本代码的使用说明
# ---------------------------------------------------------------------------
# 1. 普通函数，调用的时候直接得到返回值
# 2. 生成器函数，调用的时候返回值为一个生成器对象。具体返回值需要使用for循环来迭代获取。
# +--------------------------------------------------------------------------
def common_func(a):
    print("我是普通函数执行的逻辑。传入进来的数据为{0}".format(a))
    return a * 2


def yield_func(a):
    print("a={0}".format(a))
    yield a


if __name__ == '__main__':
    cf = common_func(3)
    print("普通函数可以读取到返回值为：{}".format(cf))

    print("-" * 50)

    yf = yield_func(2)
    print("yield函数返回值为：{}".format(yf))

# output
# 我是普通函数执行的逻辑。传入进来的数据为3
# 普通函数可以读取到返回值6
# --------------------------------------------------
# yield函数返回值为 < generator object yield_func at 0x000001DCFC1F3430>
